*** benches/concurrent_agents.rs:132:44: replace > with < in AtomicStats::finalize

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace > with < in AtomicStats::finalize
@@ -124,17 +124,17 @@
         let p99 = if !latencies.is_empty() {
             let idx = (latencies.len() as f64 * 0.99) as usize;
             latencies[idx.min(latencies.len() - 1)]
         } else {
             0
         };
 
         let duration_secs = duration.as_secs_f64();
-        let actual_rate = if duration_secs > 0.0 {
+        let actual_rate = if duration_secs < /* ~ changed by cargo-mutants ~ */ 0.0 {
             total as f64 / duration_secs
         } else {
             0.0
         };
 
         let result_status = if success_rate >= 100.0 {
             "OK".to_string()
         } else if success_rate >= 98.0 {

*** result: Success
