*** benches/concurrent_agents.rs:133:26: replace / with * in AtomicStats::finalize

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace / with * in AtomicStats::finalize
@@ -125,17 +125,17 @@
             let idx = (latencies.len() as f64 * 0.99) as usize;
             latencies[idx.min(latencies.len() - 1)]
         } else {
             0
         };
 
         let duration_secs = duration.as_secs_f64();
         let actual_rate = if duration_secs > 0.0 {
-            total as f64 / duration_secs
+            total as f64 * /* ~ changed by cargo-mutants ~ */ duration_secs
         } else {
             0.0
         };
 
         let result_status = if success_rate >= 100.0 {
             "OK".to_string()
         } else if success_rate >= 98.0 {
             "EDGE".to_string()

*** result: Success
