*** benches/concurrent_agents.rs:272:9: delete match arm "FAIL" in run_load_test

*** mutation diff:
--- benches/concurrent_agents.rs
+++ delete match arm "FAIL" in run_load_test
@@ -264,17 +264,17 @@
     let result = stats
         .finalize(actual_duration, label, &target_rate_str)
         .await;
 
     // Print inline result
     let color_code = match result.result_status.as_str() {
         "OK" => "\x1b",   // Green
         "EDGE" => "\x1b", // Yellow
-        "FAIL" => "\x1b", // Red
+         /* ~ changed by cargo-mutants ~ */ // Red
         _ => "\x1b",
     };
     let reset = "\x1b";
 
     println!(
         "  Rate: {:.0} req/s | Success: {:.1}% | P99: {}ms | {}{}{}",
         result.actual_rate,
         result.success_rate,

*** result: Success
