*** benches/concurrent_agents.rs:305:19: replace += with *= in main

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace += with *= in main
@@ -297,17 +297,17 @@
 
     let mut i = 1;
     while i < args.len() {
         match args[i].as_str() {
             "--port" => {
                 if let Some(p) = args.get(i + 1) {
                     port = p.parse().unwrap_or(8765);
                 }
-                i += 2;
+                i *= /* ~ changed by cargo-mutants ~ */ 2;
             }
             "--agents" => {
                 if let Some(a) = args.get(i + 1) {
                     agents = a.parse().unwrap_or(100);
                 }
                 i += 2;
             }
             "--duration" => {

*** result: Success
