*** benches/concurrent_agents.rs:125:47: replace * with / in AtomicStats::finalize

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace * with / in AtomicStats::finalize
@@ -117,17 +117,17 @@
             0.0
         };
 
         let mut latencies = self.latencies.lock().await;
         latencies.sort_unstable();
 
         // P99
         let p99 = if !latencies.is_empty() {
-            let idx = (latencies.len() as f64 * 0.99) as usize;
+            let idx = (latencies.len() as f64 / /* ~ changed by cargo-mutants ~ */ 0.99) as usize;
             latencies[idx.min(latencies.len() - 1)]
         } else {
             0
         };
 
         let duration_secs = duration.as_secs_f64();
         let actual_rate = if duration_secs > 0.0 {
             total as f64 / duration_secs

*** result: Success
