*** benches/concurrent_agents.rs:195:43: replace / with % in run_load_test

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace / with % in run_load_test
@@ -187,17 +187,17 @@
     // Rate setup
     // If target_rate is set, we need to throttle.
     // simplistic approach: rate per agent = target_rate / agents.
     // Interval between requests = 1 / rate_per_agent.
     let interval_per_agent = if let Some(rate) = target_rate {
         if rate == 0 {
             None
         } else {
-            let r_per_agent = rate as f64 / config.agents as f64;
+            let r_per_agent = rate as f64 % /* ~ changed by cargo-mutants ~ */ config.agents as f64;
             if r_per_agent <= 0.0 {
                 None
             } else {
                 Some(Duration::from_secs_f64(1.0 / r_per_agent))
             }
         }
     } else {
         None

*** result: Success
