*** benches/concurrent_agents.rs:242:28: replace < with == in run_load_test

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace < with == in run_load_test
@@ -234,17 +234,17 @@
         // Wrapper to enforce loop and interval
         let h = tokio::spawn(async move {
             let mut tick_next = Instant::now();
 
             while running_clone.load(Ordering::Relaxed) {
                 // Throttle
                 if let Some(interval) = interval_per_agent {
                     let now = Instant::now();
-                    if now < tick_next {
+                    if now == /* ~ changed by cargo-mutants ~ */ tick_next {
                         tokio::time::sleep_until(tokio::time::Instant::from_std(tick_next)).await;
                     }
                     tick_next += interval;
                 }
 
                 // Execute ONE iteration of the task
                 let inner_h = task_fn_clone(i, client_clone.clone(), stats_clone.clone());
                 inner_h.await.unwrap();

*** result: Success
