*** benches/concurrent_agents.rs:270:9: delete match arm "OK" in run_load_test

*** mutation diff:
--- benches/concurrent_agents.rs
+++ delete match arm "OK" in run_load_test
@@ -262,17 +262,17 @@
 
     let actual_duration = start_time.elapsed();
     let result = stats
         .finalize(actual_duration, label, &target_rate_str)
         .await;
 
     // Print inline result
     let color_code = match result.result_status.as_str() {
-        "OK" => "\x1b",   // Green
+         /* ~ changed by cargo-mutants ~ */   // Green
         "EDGE" => "\x1b", // Yellow
         "FAIL" => "\x1b", // Red
         _ => "\x1b",
     };
     let reset = "\x1b";
 
     println!(
         "  Rate: {:.0} req/s | Success: {:.1}% | P99: {}ms | {}{}{}",

*** result: Success
