*** benches/concurrent_agents.rs:301:13: delete match arm "--port" in main

*** mutation diff:
--- benches/concurrent_agents.rs
+++ delete match arm "--port" in main
@@ -293,22 +293,17 @@
     let args: Vec<String> = std::env::args().collect();
     let mut port = 8765;
     let mut agents = 100;
     let mut duration = 10;
 
     let mut i = 1;
     while i < args.len() {
         match args[i].as_str() {
-            "--port" => {
-                if let Some(p) = args.get(i + 1) {
-                    port = p.parse().unwrap_or(8765);
-                }
-                i += 2;
-            }
+             /* ~ changed by cargo-mutants ~ */
             "--agents" => {
                 if let Some(a) = args.get(i + 1) {
                     agents = a.parse().unwrap_or(100);
                 }
                 i += 2;
             }
             "--duration" => {
                 if let Some(d) = args.get(i + 1) {

*** result: Success
