*** benches/concurrent_agents.rs:308:45: replace + with - in main

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace + with - in main
@@ -300,17 +300,17 @@
         match args[i].as_str() {
             "--port" => {
                 if let Some(p) = args.get(i + 1) {
                     port = p.parse().unwrap_or(8765);
                 }
                 i += 2;
             }
             "--agents" => {
-                if let Some(a) = args.get(i + 1) {
+                if let Some(a) = args.get(i - /* ~ changed by cargo-mutants ~ */ 1) {
                     agents = a.parse().unwrap_or(100);
                 }
                 i += 2;
             }
             "--duration" => {
                 if let Some(d) = args.get(i + 1) {
                     duration = d.parse().unwrap_or(10);
                 }

*** result: Success
