*** benches/concurrent_agents.rs:314:45: replace + with - in main

*** mutation diff:
--- benches/concurrent_agents.rs
+++ replace + with - in main
@@ -306,17 +306,17 @@
             }
             "--agents" => {
                 if let Some(a) = args.get(i + 1) {
                     agents = a.parse().unwrap_or(100);
                 }
                 i += 2;
             }
             "--duration" => {
-                if let Some(d) = args.get(i + 1) {
+                if let Some(d) = args.get(i - /* ~ changed by cargo-mutants ~ */ 1) {
                     duration = d.parse().unwrap_or(10);
                 }
                 i += 2;
             }
             "--help" | "-h" => {
                 println!("Usage: concurrent-agents-bench [--port P] [--agents N] [--duration S]");
                 return Ok(());
             }

*** result: Success
