*** benches/concurrent_agents.rs:319:13: delete match arm "--help" | "-h" in main

*** mutation diff:
--- benches/concurrent_agents.rs
+++ delete match arm "--help" | "-h" in main
@@ -311,20 +311,17 @@
                 i += 2;
             }
             "--duration" => {
                 if let Some(d) = args.get(i + 1) {
                     duration = d.parse().unwrap_or(10);
                 }
                 i += 2;
             }
-            "--help" | "-h" => {
-                println!("Usage: concurrent-agents-bench [--port P] [--agents N] [--duration S]");
-                return Ok(());
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => i += 1,
         }
     }
 
     let config = Config {
         base_url: format!("http://127.0.0.1:{}", port),
         agents,
         duration_secs: duration,

*** result: Success
